# St7SmoothPlates

Smooths the selected plate elements.

long St7SmoothPlates(long uID, long UCSId, bool SmoothBoundary)
Input Parameters
uID
Strand7 model file ID.
UCSId
The coordinate system in which to smooth the plate edges.
SmoothBoundary
True to allow the smoothing function to move boundary nodes.
Dependencies
Selection
Plates can be selected using functions in Entity Selection.
Keep Selected
Assigned using St7SetKeepSelect.